src/Algorithms/TheoryOfAlgorithms/HeavyLightDecomposition.org
#+SETUPFILE: ~/.emacs.d/src/org-templates/level-2.org
#+TITLE: Heavy Light Decomposition
#+OPTIONS: num:nil H:2




https://blog.anudeep2011.com/heavy-light-decomposition/

* Overview
The heavy-light (H-L) decomposition of a rooted tree is a method of
partitioning of the vertices of the tree into disjoint paths (all
vertices have degree two, except the endpoints of a path, with degree
one) that gives important asymptotic time bounds for certain problems
involving trees.[fn:1]

* More
+ [[http://www.geeksforgeeks.org/heavy-light-decomposition-set-1-introduction/][Introduction]] and [[http://www.geeksforgeeks.org/heavy-light-decomposition-set-2-implementation/][implementation]] by geeksforgeeks
+ Description and application: http://e-maxx.ru/algo/heavy_light


* cc

#+begin_src c++

#+end_src

* Footnotes

[fn:1] http://wcipeg.com/wiki/Heavy-light_decomposition


