public_html/Algorithms/TheoryOfAlgorithms/HeavyLightDecomposition.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Heavy Light Decomposition</title>
<!-- 2016-11-13 Sun 23:50 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Shi Shougang" />
<link href="../../assets/bootstrap.min.css" rel="stylesheet" media="screen">
<link href="../../assets/bootstrap-responsive.min.css" rel="stylesheet">
<link rel="stylesheet" type="text/css" href="../../assets/stylesheet.css" />
</head>
<body>
<div id="content">
<h1 class="title">Heavy Light Decomposition</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Overview</a></li>
<li><a href="#sec-2">More</a></li>
<li><a href="#sec-3">cc</a></li>
</ul>
</div>
</div>
<p>
<a href="https://blog.anudeep2011.com/heavy-light-decomposition/">https://blog.anudeep2011.com/heavy-light-decomposition/</a>
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Overview</h2>
<div class="outline-text-2" id="text-1">
<p>
The heavy-light (H-L) decomposition of a rooted tree is a method of
partitioning of the vertices of the tree into disjoint paths (all
vertices have degree two, except the endpoints of a path, with degree
one) that gives important asymptotic time bounds for certain problems
involving trees.<sup><a id="fnr.1" name="fnr.1" class="footref" href="#fn.1">1</a></sup>
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">More</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><a href="http://www.geeksforgeeks.org/heavy-light-decomposition-set-1-introduction/">Introduction</a> and <a href="http://www.geeksforgeeks.org/heavy-light-decomposition-set-2-implementation/">implementation</a> by geeksforgeeks
</li>
<li>Description and application: <a href="http://e-maxx.ru/algo/heavy_light">http://e-maxx.ru/algo/heavy_light</a>
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">cc</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">

<pre class="src src-c++"></pre>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" name="fn.1" class="footnum" href="#fnr.1">1</a></sup> <p class="footpara">
<a href="http://wcipeg.com/wiki/Heavy-light_decomposition">http://wcipeg.com/wiki/Heavy-light_decomposition</a>
</p></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author: Shi Shougang</p>
<p class="date">Created: 2016-11-13 Sun 23:50</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
